<template>
    <v-container>
        <v-row class="ma-0" justify="center">
            <v-col cols="12">
                <v-card v-if="tourId === 1">
                    <div class="card-header pa-4">
                        <h1 class="card-header__title">Млин Германа Нібура</h1>
                    </div>

                    <v-divider></v-divider>

                    <v-card-text class="card-text pa-4">
                        <p>
                            Млин Германа Нібура розташований на території колишньої Менонітської колонії Шенвізе, яка знаходилась від сучасної площі Привокзальної до річки Мокрої Московки. Забудова Шенвізе пов’язана з іменами видатних підприємців: Дика, Копа, Нейфельда, Нібура, Сіменса.
                        </p>

                        <p>
                            Млин збудував меноніт Герман Нібур – онук засновника династії пруських млинарів Якоба Нібура. Герман Нібур створив товариство «Нібур Г.А. і Ко», яке займалось експортом борошна до Туреччини, Єгипту, Греції завдяки налагодженому пароплавному сполученню. Компанії належали 11 вальцевих млинів на території Олександрівська.
                        </p>

                        <p>
                            Млин був відкритий в 1895 році після того як власник Герман Нібур відвідав Америку. Він туди за досвідом їздив, можна сказати. Вивчав досвід тоді найбільших млинів у світі, вони в Міннеаполісі знаходились – центрі борошномельної промисловості. Він побачив найбільший на той час паровий млин Пілсбері. Захотілось йому щось подібне збудувати і у себе вдома. Повернувшись, він на території менонітського селища Шенвізе відкрив млин.
                        </p>

                        <slider id="1" :images="images1" class="tour-slider mb-4"></slider>

                        <p>
                            Новий млин в колонії Шенвізе мав назву млин №5. На той час це був один з найпотужніших млинів у Європі. Всі 11 млинів Нібура виготовляли в середньому 300 тон борошна на добу, з них найбільший, млин №5 – майже 100 тон на добу (5000 пудів). На млині працювало 25 людей. Він був обладнаний паровими машинами фірми «Компаунд», вальцевими станками заводу Вегмана (Цюрих), динамомашиною заводів Гарбе, Ламайєр.
                        </p>

                        <p>
                            Довгий час п’ятиповерховий млин Нібура був найвищою спорудою Олександрівська.
                        </p>

                        <p>
                            Якщо брати Олександрівськ того часу, то будівля млина Нібура – це гігантська споруда. Наприкінці 19 ст. двоповерхові споруди були якимось виключенням для Олександрівська, переважно архітектура одноповерховою була такою, а тут прямо хмарочос збудували. Тим більше він на же на підвищенні стоїть, думаю, що його було помітно зі всіх куточнків Олександрівська. І обладнаний він був за останнім словом техніки. Там було найсучасніше обладнання і гілка залізниці окрема до млина підходила і навіть електростанція була. В Олександрівську тоді взагалі електростанції ще не було, вона з’явилась тільки в 1910. А ось при млині своя автономна електростанція вже працювала з кінця 19 ст.
                        </p>

                        <p>
                            Млин Нібура має цінність не лише як пам’ятка архітектури, а й як об’єкт, завдяки якому врятовано багато життів людей під час Голодомору 1921-1923 років. Саме у будівлі млина Нібура знаходився розподільний пункт гуманітарної допомоги, отриманої з Європи та Америки.
                        </p>

                        <p>
                            На млині Нібура був один з розподільчих пунктів харчів, які ми отримували з Північної Америки та з Європи. Була тоді створена ціла організація «Американська менонітська допомога», створено Центральний менонітський комітет. І закордонні меноніти допомагали і своїм одновірцям, які тут жили, і всім іншим мешканцям. Всі гуманітарні вантажі спочатку звозились до Одеси, а потім з порту відвозились на млин Нібура і там зберігались, там розподілялись. Допомогою тоді вони охопили по моїм підрахункам не менше 250 тисяч мешканців сучасної Запорізької області.
                        </p>

                        <p>
                            З приходом більшовиків млин Нібура націоналізували, як млин він працював до кінця 20 ст. Зараз у будівлі розташована креативна платформа «Млин», яка організовує різноманітні творчі, освітні, соціальні заходи.
                        </p>

                        <slider id="2" :images="images2" class="tour-slider mb-4"></slider>

                        <p>
                            14 жовтня 2022 року близько 5 ранку ворог атакував Запоріжжя ракетами С-300. Одна з них влучила поруч з історичною будівлею, значно пошкодивши елеватор, який був збудуваний значно пізніше самого млина. В історичній будівлі вибило шибки та посікло фасад.
                        </p>

                        <slider id="3" :images="images3" class="tour-slider"></slider>
                    </v-card-text>
                </v-card>

                <v-card v-if="tourId === 6">
                    <div class="card-header pa-4">
                        <h1 class="card-header__title">Гуляйпільський краєзнавчий музей</h1>
                    </div>

                    <v-divider></v-divider>

                    <v-card-text class="card-text pa-4">
                        <p>
                            Гуляйпільський краєзнавчий музей заснований 11 грудня 1960 року. Будівля музею споруджена у 1901 році як приміщення банку «Товариство взаємного кредиту». У роки Другої Світової війни тут знаходилася церква. У повоєнні часи — районний будинок культури, з 1989 року — будівля музею.
                        </p>

                        <slider id="4" :images="images4" class="tour-slider mb-4"></slider>

                        <p>
                            У грудні 2022 року фасади та дах музею були пошкоджені російським обстрілом. У ніч на 24 серпня 2024 року будівля музею вигоріла вщент від влучання російського снаряду. Експонати на той час були евакуйовані до Запорізького краєзнавчого музею. До цього в будівлю Гуляйпільського музею було ще три влучання.
                        </p>

                        <slider id="5" :images="images5" class="tour-slider mb-4"></slider>
                    </v-card-text>
                </v-card>

                <v-card v-if="tourId === 7">
                    <div class="card-header pa-4">
                        <h1 class="card-header__title">Паровий млин «Надія»</h1>
                    </div>

                    <v-divider></v-divider>

                    <v-card-text class="card-text pa-4">
                        <p>
                            У1894 році млин був збудований купцем II гільдії євреєм Самсоном Йосиповичем Саксаганським. Виконавцем робіт стала відома фірма німця Антона Ерлангера із Москви, якого називали «борошномельним королем» Російської імперії.
                            Млин, в який купець вклав величезні кошти та заліз у борги так і не запрацював на повну потужність при першому власнику.
                            Паровий двигун, який замовили в Англії, установили та випробували в 1895 році. А в 1898 році він був опечатаний та до 1908 року не був пущений в роботу.
                            Власник мав проблеми з Фабричним комітетом який давав дозволи на початок виробництва. Справа виявилась збитковою та не виправдала очікувань.
                        </p>

                        <p>
                            У 1908 році меноніт Давид Шредер купив млин у Самсона Саксаганського. При Шредері для цього підприємства почались "золоті часи" - він запрацював у повну силу.
                            У 1912 році до парового двигуна вирішили приєднати генератор, який давав електроенергію на 12 ліхтарів у центрі міста, також найбагатші люди могли провести собі в будинки електрику. Таким чином, млин став першою електростанцією Гуляйполя.
                        </p>

                        <p>
                            З 1915 року млин - у власності акціонерного товариства "Кємах".
                            В радянський період використовувався за призначенням, як млин.
                        </p>

                        <slider id="6" :images="images6" class="tour-slider mb-4"></slider>

                        <p>
                            Млин "Надія" був зруйнований росіянами в результаті потужної атаки у лютому 2024. Ця будівля в центрі прифронтового міста вже зазнавала пошкоджень внаслідок обстрілу російськими військовими в червні 2022 та липні 2023 років. Проте тоді будівля все ж встояла. А тепер вона майже вщент знищена.
                        </p>

                        <slider id="7" :images="images7" class="tour-slider mb-4"></slider>
                    </v-card-text>
                </v-card>

                <!-- https://suspilne.media/zaporizhzhia/551277-istoricna-castina-zrujnovana-ale-ne-vtracena-ak-nini-vigladae-kulturna-spadsina-gulajpola/ -->
            </v-col>
        </v-row>
    </v-container>
</template>

<script>
    import Slider from '@/js/components/Slider';

    export default {
        name: 'VirtualTour',

        components: {
            Slider,
        },

        data() {
            return {
                images1: [
                    '/storage/images/slider/mlyn/mlyn_1_1.webp',
                    '/storage/images/slider/mlyn/mlyn_1_2.webp'
                ],
                images2: [
                    '/storage/images/slider/mlyn/mlyn_2_1.jpg',
                    '/storage/images/slider/mlyn/mlyn_2_2.jpg',
                    '/storage/images/slider/mlyn/mlyn_2_3.jpg',
                    '/storage/images/slider/mlyn/mlyn_2_4.jpg',
                    '/storage/images/slider/mlyn/mlyn_2_5.jpg',
                    '/storage/images/slider/mlyn/mlyn_2_6.jpg'
                ],
                images3: [
                    '/storage/images/slider/mlyn/mlyn_3_1.jpg',
                    '/storage/images/slider/mlyn/mlyn_3_2.jpg',
                    '/storage/images/slider/mlyn/mlyn_3_3.jpg',
                    '/storage/images/slider/mlyn/mlyn_3_4.jpg',
                    '/storage/images/slider/mlyn/mlyn_3_5.jpg',
                    '/storage/images/slider/mlyn/mlyn_3_6.jpg',
                    '/storage/images/slider/mlyn/mlyn_3_7.jpg'
                ],

                images4: [
                    '/storage/images/slider/muzei/muzei_1_1.jpg',
                    '/storage/images/slider/muzei/muzei_1_2.jpg',
                ],

                images5: [
                    '/storage/images/slider/muzei/muzei_2_1.jpg',
                    '/storage/images/slider/muzei/muzei_2_2.jpg',
                    '/storage/images/slider/muzei/muzei_2_3.jpg',
                    '/storage/images/slider/muzei/muzei_2_4.jpg',
                    '/storage/images/slider/muzei/muzei_2_5.jpg',
                    '/storage/images/slider/muzei/muzei_2_6.jpg',
                    '/storage/images/slider/muzei/muzei_2_7.jpg',
                    '/storage/images/slider/muzei/muzei_2_8.jpg',
                ],

                images6: [
                    '/storage/images/slider/mlyn_nadiya/mlyn_1_1.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_1_2.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_1_3.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_1_4.jpg',
                ],

                images7: [
                    '/storage/images/slider/mlyn_nadiya/mlyn_2_1.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_2_2.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_2_3.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_2_4.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_2_5.jpg',
                    '/storage/images/slider/mlyn_nadiya/mlyn_2_6.jpg',
                ],
            }
        },

        computed: {
            tourId() {
                return this.$route.params.id;
            }
        }
    }
</script>

<style lang="scss" scoped>
.card-header {

}

.card-header__title {
    font-size: 32px;
    font-weight: 500;
    color: rgba(46, 38, 61, 0.9);
}

.card-text {
    font-size: 16px;
}

.tour-slider {
    width: 100%;
    max-width: 1000px;
    margin: 0 auto;
}
</style>
