<template>
    <v-container>
        <v-row class="ma-0" justify="center">
            <v-col cols="12">
                <v-card>
                    <div class="card-header pa-4">
                        <h1 class="card-header__title">Млин Германа Нібура</h1>
                    </div>

                    <v-divider></v-divider>

                    <v-card-text class="card-text pa-4">
                        <p>
                            Млин Германа Нібура розташований на території колишньої Менонітської колонії Шенвізе, яка знаходилась від сучасної площі Привокзальної до річки Мокрої Московки. Забудова Шенвізе пов’язана з іменами видатних підприємців: Дика, Копа, Нейфельда, Нібура, Сіменса.
                        </p>

                        <p>
                            Млин збудував меноніт Герман Нібур – онук засновника династії пруських млинарів Якоба Нібура. Герман Нібур створив товариство «Нібур Г.А. і Ко», яке займалось експортом борошна до Туреччини, Єгипту, Греції завдяки налагодженому пароплавному сполученню. Компанії належали 11 вальцевих млинів на території Олександрівська.
                        </p>

                        <p>
                            Млин був відкритий в 1895 році після того як власник Герман Нібур відвідав Америку. Він туди за досвідом їздив, можна сказати. Вивчав досвід тоді найбільших млинів у світі, вони в Міннеаполісі знаходились – центрі борошномельної промисловості. Він побачив найбільший на той час паровий млин Пілсбері. Захотілось йому щось подібне збудувати і у себе вдома. Повернувшись, він на території менонітського селища Шенвізе відкрив млин.
                        </p>

                        <slider id="1" :images="images1" class="tour-slider mb-4"></slider>

                        <p>
                            Новий млин в колонії Шенвізе мав назву млин №5. На той час це був один з найпотужніших млинів у Європі. Всі 11 млинів Нібура виготовляли в середньому 300 тон борошна на добу, з них найбільший, млин №5 – майже 100 тон на добу (5000 пудів). На млині працювало 25 людей. Він був обладнаний паровими машинами фірми «Компаунд», вальцевими станками заводу Вегмана (Цюрих), динамомашиною заводів Гарбе, Ламайєр.
                        </p>

                        <p>
                            Довгий час п’ятиповерховий млин Нібура був найвищою спорудою Олександрівська.
                        </p>

                        <p>
                            Якщо брати Олександрівськ того часу, то будівля млина Нібура – це гігантська споруда. Наприкінці 19 ст. двоповерхові споруди були якимось виключенням для Олександрівська, переважно архітектура одноповерховою була такою, а тут прямо хмарочос збудували. Тим більше він на же на підвищенні стоїть, думаю, що його було помітно зі всіх куточнків Олександрівська. І обладнаний він був за останнім словом техніки. Там було найсучасніше обладнання і гілка залізниці окрема до млина підходила і навіть електростанція була. В Олександрівську тоді взагалі електростанції ще не було, вона з’явилась тільки в 1910. А ось при млині своя автономна електростанція вже працювала з кінця 19 ст.
                        </p>

                        <p>
                            Млин Нібура має цінність не лише як пам’ятка архітектури, а й як об’єкт, завдяки якому врятовано багато життів людей під час Голодомору 1921-1923 років. Саме у будівлі млина Нібура знаходився розподільний пункт гуманітарної допомоги, отриманої з Європи та Америки.
                        </p>

                        <p>
                            На млині Нібура був один з розподільчих пунктів харчів, які ми отримували з Північної Америки та з Європи. Була тоді створена ціла організація «Американська менонітська допомога», створено Центральний менонітський комітет. І закордонні меноніти допомагали і своїм одновірцям, які тут жили, і всім іншим мешканцям. Всі гуманітарні вантажі спочатку звозились до Одеси, а потім з порту відвозились на млин Нібура і там зберігались, там розподілялись. Допомогою тоді вони охопили по моїм підрахункам не менше 250 тисяч мешканців сучасної Запорізької області.
                        </p>

                        <p>
                            З приходом більшовиків млин Нібура націоналізували, як млин він працював до кінця 20 ст. Зараз у будівлі розташована креативна платформа «Млин», яка організовує різноманітні творчі, освітні, соціальні заходи.
                        </p>

                        <slider id="2" :images="images2" class="tour-slider mb-4"></slider>

                        <p>
                            14 жовтня 2022 року близько 5 ранку ворог атакував Запоріжжя ракетами С-300. Одна з них влучила поруч з історичною будівлею, значно пошкодивши елеватор, який був збудуваний значно пізніше самого млина. В історичній будівлі вибило шибки та посікло фасад.
                        </p>

                        <slider id="3" :images="images3" class="tour-slider"></slider>
                    </v-card-text>
                </v-card>
            </v-col>
        </v-row>
    </v-container>
</template>

<script>
    import Slider from '@/js/components/Slider';

    export default {
        name: 'VirtualTour',

        components: {
            Slider,
        },

        data() {
            return {
                images1: [
                    '/storage/images/slider/mlyn_1_1.webp',
                    '/storage/images/slider/mlyn_1_2.webp'
                ],
                images2: [
                    '/storage/images/slider/mlyn_2_1.jpg',
                    '/storage/images/slider/mlyn_2_2.jpg',
                    '/storage/images/slider/mlyn_2_3.jpg',
                    '/storage/images/slider/mlyn_2_4.jpg',
                    '/storage/images/slider/mlyn_2_5.jpg',
                    '/storage/images/slider/mlyn_2_6.jpg'
                ],
                images3: [
                    '/storage/images/slider/mlyn_3_1.jpg',
                    '/storage/images/slider/mlyn_3_2.jpg',
                    '/storage/images/slider/mlyn_3_3.jpg',
                    '/storage/images/slider/mlyn_3_4.jpg',
                    '/storage/images/slider/mlyn_3_5.jpg',
                    '/storage/images/slider/mlyn_3_6.jpg',
                    '/storage/images/slider/mlyn_3_7.jpg'
                ],
            }
        },
    }
</script>

<style lang="scss" scoped>
.card-header {

}

.card-header__title {
    font-size: 32px;
    font-weight: 500;
    color: rgba(46, 38, 61, 0.9);
}

.card-text {
    font-size: 16px;
}

.tour-slider {
    width: 100%;
    max-width: 1000px;
    margin: 0 auto;
}
</style>
